# 構想: 黃子嘉老師
文字容器=['愛', '愛', '愛', '完', '不', '完']  #文字容器=[10, 20, 20, 30]
取出字數=3
計數=0

def 長尾巴左到右(已取文字集): # 十字法 里程表法
	
	if len(已取文字集) == 取出字數:
		global 計數
		計數+=1
		print(str(計數)+"=", 已取文字集)
		return # 上帝指示

	那些尾巴=拷貝後除重複字(文字容器, 已取文字集)
	尾巴個數=len(那些尾巴)
	
	快取那份=[] # 重要
	for 第幾個 in range(0, 尾巴個數):
		拷貝那份=已取文字集.copy()
		拷貝那份.append(那些尾巴[第幾個])
		
		if 拷貝那份 != 快取那份:
			快取那份=拷貝那份
			長尾巴左到右(拷貝那份)
#########################
def 拷貝後除重複字(文字容器, 該排除文字集):
	拷貝容器 =文字容器.copy()
	for 字 in 該排除文字集: 拷貝容器.remove(字)
	return 拷貝容器
#######################
文字容器.sort() # 重要
長尾巴左到右([])

# 輸出:
# 1=['不', '完', '完']
# 2=['不', '完', '愛']
# 3=['不', '愛', '完']
# 4=['不', '愛', '愛']
# 5=['完', '不', '完']
# 6=['完', '不', '愛']
# 7=['完', '完', '不']
# 8=['完', '完', '愛']
# 9=['完', '愛', '不']
# 10=['完', '愛', '完']
# 11=['完', '愛', '愛']
# 12=['愛', '不', '完']
# 13=['愛', '不', '愛']
# 14=['愛', '完', '不']
# 15=['愛', '完', '完']
# 16=['愛', '完', '愛']
# 17=['愛', '愛', '不']
# 18=['愛', '愛', '完']
# 19=['愛', '愛', '愛']